{
  "locations": [
    {
      "id": 100,
      "name": "Dorm Room (Knox Residence)",
      "brief_description": "This is your dorm room at Knox Residence. You can go out west to St. George Street or east to Front Campus.",
      "long_description": "The small, dimly-lit room is a chaotic reflection of a student in the middle of midterm season. A single bed sits unmade in the corner, its rumpled sheets tangled like they've been wrestling with your dreams. The faint scent of old coffee and stale instant noodles hangs in the air, blending with the soft hum St. George Street, which lies right outside of your window. You can go out west to St. George Street or east to Front Campus.",
      "extra_description": "A cluttered desk sits against the far wall, buried under stacks of lecture notes, practice exams, empty Red Bull cans, and a sticky note-covered calendar that mocks you with its deadlines. A crooked poster of the CN Tower hangs above it, curling at the edges from humidity. Your trusty backpack lies discarded by the door, half-zipped, as if even it gave up trying to stay organized. You see your wallet, laying flat and open on the table.",
      "available_commands": {
        "go west": 303,
        "go east": 1202
      },
      "items": []
    },
    {
      "id": 200,
      "name": "Robarts Library",
      "brief_description": "This is Robarts Library. You can go out east to Saint George and Hoskin Crossroads.",
      "long_description": "You are currently at Robarts Library. There's a lot happening around you.",
      "available_commands": {
        "go east": 500
      },
      "items": []
    },
    {
      "id": 500,
      "name": "Saint George and Hoskin Crossroads",
      "brief_description": "This is Saint George and Hoskin Crossroads. You can go out west to Robarts Library, south to St. George Street 1, or east to Hoskin Street 1.",
      "long_description": "You are currently at Saint George and Hoskin Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go west": 200,
        "go south": 301,
        "go east": 401
      },
      "items": []
    },
    {
      "id": 401,
      "name": "Hoskin Street 1",
      "brief_description": "This is Hoskin Street 1. You can go out west to Saint George and Hoskin Crossroads or east to Hoskin Street 2.",
      "long_description": "You are currently at Hoskin Street 1. There's a lot happening around you.",
      "available_commands": {
        "go west": 500,
        "go east": 402
      },
      "items": []
    },
    {
      "id": 402,
      "name": "Hoskin Street 2",
      "brief_description": "This is Hoskin Street 2. You can go out west to Hoskin Street 1, south to Tower Road, or east to Hoskin Street 3.",
      "long_description": "You are currently at Hoskin Street 2. There's a lot happening around you.",
      "available_commands": {
        "go west": 401,
        "go south": 1700,
        "go east": 403
      },
      "items": []
    },
    {
      "id": 403,
      "name": "Hoskin Street 3",
      "brief_description": "This is Hoskin Street 3. You can go out west to Hoskin Street 2 or east to Hoskin and Queen's Crescent Crossroads.",
      "long_description": "You are currently at Hoskin Street 3. There's a lot happening around you.",
      "available_commands": {
        "go west": 402,
        "go east": 800
      },
      "items": []
    },
    {
      "id": 800,
      "name": "Hoskin and Queen's Crescent Crossroads",
      "brief_description": "This is Hoskin and Queen's Crescent Crossroads. You can go out west to Hoskin Street 3, south to Queen's Park Crescent 1, or east to Queen's Park 1.",
      "long_description": "You are currently at Hoskin and Queen's Crescent Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go west": 403,
        "go south": 901,
        "go east": 1001
      },
      "items": []
    },
    {
      "id": 1800,
      "name": "Sir Daniel Wilson Residence Path",
      "brief_description": "This is Sir Daniel Wilson Residence's path. You can go out west to St. George Street 2 or east to Front Campus 1.",
      "long_description": "You are currently at Sir Daniel Wilson Residence Path. There's a lot happening around you.",
      "available_commands": {
        "go west": 302,
        "go east": 1201
      },
      "items": []
    },
    {
      "id": 301,
      "name": "St. George Street 1",
      "brief_description": "This is St. George Street 1. You can go out north to Saint George and Hoskin Crossroads, south to St. George Street 2, or east to Cafe Reznikoff.",
      "long_description": "You are currently at St. George Street 1. There's a lot happening around you.",
      "available_commands": {
        "go north": 500,
        "go south": 302,
        "go east" : 1100
      },
      "items": []
    },
    {
      "id": 302,
      "name": "St. George Street 2",
      "brief_description": "This is St. George Street 2. You can go out north to St. George Street 1, south to St. George Street 3, or east to Sir Daniel Wilson Residence Path.",
      "long_description": "You are currently at St. George Street 2. There's a lot happening around you.",
      "available_commands": {
        "go north": 301,
        "go south": 303,
        "go east": 1800
      },
      "items": []
    },
    {
      "id": 303,
      "name": "St. George Street 3",
      "brief_description": "This is St. George Street 3. You can go out north to St. George Street 2, south to St. George Street 4, or east to Dorm Room (Knox Residence).",
      "long_description": "You are currently at St. George Street 3. There's a lot happening around you.",
      "available_commands": {
        "go north": 302,
        "go south": 304,
        "go east": 100
      },
      "items": []
    },
    {
      "id": 304,
      "name": "St. George Street 4",
      "brief_description": "This is St. George Street 4. You can go out north to St. George Street 3, south to St George and College Crossroads, or west to Bahen.",
      "long_description": "You are currently at St. George Street 4. There's a lot happening around you.",
      "available_commands": {
        "go north": 303,
        "go south":1500,
        "go west": 1600
      },
      "items": []
    },
    {
      "id": 1100,
      "name": "Cafe Reznikoff",
      "brief_description": "This is Cafe Reznikoff. You can go out west to St. George Street 1.",
      "long_description": "You are currently at Cafe Reznikoff. There's a lot happening around you.",
      "available_commands": {
        "go west": 301
      },
      "items": [],
      "first_time_event_id": 110001
    },
    {
      "id": 1201,
      "name": "Front Campus 1",
      "brief_description": "This is Front Campus 1. You can go out north to Hoskin Street 2, south to Front Campus 2, west to Cafe Reznikoff, or east to Hart House Circle.",
      "long_description": "You are currently at Front Campus 1. There's a lot happening around you.",
      "available_commands": {
        "go north": 402,
        "go south": 1202,
        "go west": 1100,
        "go east": 1400
      },
      "items": []
    },
    {
      "id": 1202,
      "name": "Front Campus 2",
      "brief_description": "This is Front Campus 2. You can go out north to Front Campus 1, south to Anatomy Lane, west to Dorm Room (Knox Residence), or east to Hart House Circle.",
      "long_description": "You are currently at Front Campus 2. There's a lot happening around you.",
      "available_commands": {
        "go north": 1201,
        "go south": 1300,
        "go west": 100,
        "go east": 1400
      },
      "items": []
    },
    {
      "id": 1203,
      "name": "King's College Road",
      "brief_description": "This is King's College Road. You can go out north to Front Campus 2 or south to College Street 2.",
      "long_description": "You are currently at King's College Road. There's a lot happening around you.",
      "available_commands": {
        "go north": 1202,
        "go south": 602
      },
      "items": []
    },
    {
      "id": 1300,
      "name": "Anatomy Lane",
      "brief_description": "This is Anatomy Lane. You can go out east to Queen's Park Crescent 3 or west to Front Campus 2.",
      "long_description": "You are currently at Anatomy Lane. There's a lot happening around you.",
      "available_commands": {
        "go east": 903,
        "go west": 1202
      },
      "items": []
    },
    {
      "id": 1400,
      "name": "Hart House Circle",
      "brief_description": "This is Hart House Circle. You can go out west to Front Campus 1 or east to Queen's Park Crescent 2.",
      "long_description": "You are currently at Hart House Circle. There's a lot happening around you.",
      "available_commands": {
        "go west": 1201,
        "go east": 902
      },
      "items": []
    },
    {
      "id": 901,
      "name": "Queen's Park Crescent 1",
      "brief_description": "This is Queen's Park Crescent 1. You can go out north to Hoskin and Queen's Crescent Crossroads, south to Queen's Park Crescent 2, or east to Queen's Park 2.",
      "long_description": "You are currently at Queen's Park Crescent 1. There's a lot happening around you.",
      "available_commands": {
        "go north": 800,
        "go south": 902,
        "go east": 1002
      },
      "items": []
    },
    {
      "id": 902,
      "name": "Queen's Park Crescent 2",
      "brief_description": "This is Queen's Park Crescent 2. You can go out north to Queen's Park Crescent 1, south to Queen's Park Crescent 3, west to Hart House Circle, or east to Queen's Park 3.",
      "long_description": "You are currently at Queen's Park Crescent 2. There's a lot happening around you.",
      "available_commands": {
        "go north": 901,
        "go south": 903,
        "go west": 1400,
        "go east": 1003
      },
      "items": []
    },
    {
      "id": 903,
      "name": "Queen's Park Crescent 3",
      "brief_description": "This is Queen's Park Crescent 3. You can go out north to Queen's Park Crescent 2, south to Queen's Park Crescent 4, west to Anatomy Lane, or east to Queen's Park 4.",
      "long_description": "You are currently at Queen's Park Crescent 3. There's a lot happening around you.",
      "available_commands": {
        "go north": 902,
        "go south": 904,
        "go west": 1300,
        "go east": 1004
      },
      "items": []
    },
    {
      "id": 904,
      "name": "Queen's Park Crescent 4",
      "brief_description": "This is Queen's Park Crescent 4. You can go out north to Queen's Park Crescent 3 or west to Bahen.",
      "long_description": "You are currently at Queen's Park Crescent 4. There's a lot happening around you.",
      "available_commands": {
        "go north": 903,
        "go west": 1600
      },
      "items": []
    },
    {
      "id": 1001,
      "name": "Queen's Park 1",
      "brief_description": "This is Queen's Park 1. You can go out west to Hoskin and Queen's Crescent Crossroads or south to Queen's Park 2.",
      "long_description": "You are currently at Queen's Park 1. There's a lot happening around you.",
      "available_commands": {
        "go west": 800,
        "go south": 1002
      },
      "items": []
    },
    {
      "id": 1002,
      "name": "Queen's Park 2",
      "brief_description": "This is Queen's Park 2. You can go out north to Queen's Park 1, south to Queen's Park 3, or west to Queen's Park Crescent 1.",
      "long_description": "You are currently at Queen's Park 2. There's a lot happening around you.",
      "available_commands": {
        "go north": 1001,
        "go south": 1003,
        "go west": 901
      },
      "items": []
    },
    {
      "id": 1003,
      "name": "Queen's Park 3",
      "brief_description": "This is Queen's Park 3. You can go out north to Queen's Park 2, south to Queen's Park 4, or west to Queen's Park Crescent 2.",
      "long_description": "You are currently at Queen's Park 3. There's a lot happening around you.",
      "available_commands": {
        "go north": 1002,
        "go south": 1004,
        "go west": 902
      },
      "items": []
    },
    {
      "id": 1004,
      "name": "Queen's Park 4",
      "brief_description": "This is Queen's Park 4. You can go out north to Queen's Park 3 or west to Queen's Park Crescent 3.",
      "long_description": "You are currently at Queen's Park 4. There's a lot happening around you.",
      "available_commands": {
        "go north": 1003,
        "go west": 903
      },
      "items": []
    },
    {
      "id": 1600,
      "name": "Bahen",
      "brief_description": "This is Bahen. You can go out north to Dorm Room (Knox Residence), east to Queen's Park Crescent 4, or south to St George and College Crossroads.",
      "long_description": "You are currently at Bahen. There's a lot happening around you.",
      "available_commands": {
        "go north": 100,
        "go east": 904,
        "go south":1500
      },
      "items": []
    },
    {
      "id":1500,
      "name": "St George and College Crossroads",
      "brief_description": "This is St George and College Crossroads. You can go out north to St. George Street 4 or east to College Street 1.",
      "long_description": "You are currently at St George and College Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go north": 304,
        "go east": 601
      },
      "items": []
    },
    {
      "id": 601,
      "name": "College Street 1",
      "brief_description": "This is College Street 1. You can go out west to St George and College Crossroads or east to College Street 2.",
      "long_description": "You are currently at College Street 1. There's a lot happening around you.",
      "available_commands": {
        "go west":1500,
        "go east": 602
      },
      "items": []
    },
    {
      "id": 602,
      "name": "College Street 2",
      "brief_description": "This is College Street 2. You can go out west to College Street 1 or east to College Street 3.",
      "long_description": "You are currently at College Street 2. There's a lot happening around you.",
      "available_commands": {
        "go west": 601,
        "go east": 603
      },
      "items": []
    },
    {
      "id": 603,
      "name": "College Street 3",
      "brief_description": "This is College Street 3. You can go out west to College Street 2 or east to College and Queen's Crescent Crossroads.",
      "long_description": "You are currently at College Street 3. There's a lot happening around you.",
      "available_commands": {
        "go west": 602,
        "go east": 700
      },
      "items": []
    },
    {
      "id": 700,
      "name": "College and Queen's Crescent Crossroads",
      "brief_description": "This is College and Queen's Crescent Crossroads. You can go out west to College Street 3.",
      "long_description": "You are currently at College and Queen's Crescent Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go west": 603
      },
      "items": []
    },
    {
      "id": 1700,
      "name": "Tower Road",
      "brief_description": "This is Tower Road. You can go out north to Hoskin Street 2 or south to Front Campus 1.",
      "long_description": "You are currently at Tower Road. There's a lot happening around you.",
      "available_commands": {
        "go north": 402,
        "go south": 1201
      },
      "items": []
    }
  ],
  "story_events": [
    {
      "id": 1,
      "name": "Dorm Room (Wake Up)",
      "available_commands": {
        "turn off alarm": 10001
      },
      "story_text": "You jolt awake to the sound of Reveille, your alarm blasting the sound of trumpets into your ears.",
      "choices": ["Turn of alarm"]
    },
    {
      "id": 10001,
      "name": "Dorm Room (Alarm)",
      "available_commands": {
        "wake up": 10002,
        "go back to sleep": 90001
      },
      "story_text": "The room is eerily quite now. The alarm is off, but your heart is still racing. What will you do?",
      "choices": ["Wake up", "Go back to sleep"]
    },
    {
      "id": 10002,
      "name": "Dorm Room (Waking up)",
      "available_commands": {
        "check alarm label": 10003
      },
      "story_text": "You are groggy and disoriented, but you force yourself up. You mind is fuzzy, and you can't recall anything. You look around to see if anything will clue you in.",
      "choices": ["Check alarm label"]
    },
    {
      "id": 10003,
      "name": "Dorm Room (Alarm Label)",
      "available_commands": {
        "next": 10004
      },
      "story_text": "You check your alarm label. Oh. Oh no. The Project!",
      "choices": ["Next"]
    },
    {
      "id": 10004,
      "name": "Dorm Room (Uh oh)",
      "available_commands": {
        "read note": 10005
      },
      "story_text": [
        "The realization hits you like a sledgehammer to the brain.",
        "Your eyes dart to the clock. The deadline is at 4 PM. Panic wells up inside you, but something else catches your eye: a crumpled note on your desk.",
        "You rub the sleep from your eyes, heart pounding like it's running a marathon. You snatch the note with trembling fingers."
      ],
      "choices": ["Read note"]
    },
    {
      "id": 10005,
      "name": "Dorm Room (First Mysterious Note)",
      "available_commands": {
        "flip out": 10006
      },
      "story_text": [
        "[\"Calm down, sleepyhead! You're gonna need your wits today.\"]",
        "The handwriting looks... familiar. But there's no time to dwell on that. You need to submit your project. You open your laptop. It's out cold.",
        "You find another yellow sticky note on your laptop screen:",
        "",
        "[\"My condolences :D\"]",
        "",
        "\"You've got to be kidding me!\", you scream internally.",
        "",
        "\"Well, at least I've still got my trusty ol' mug!\" You open your drawer, to where your lucky mug was, is, and always will be.",
        "Instead of a mug, you find yet another yellow note.",
        "[\"Shouldn't have said that ;D\"]"
      ],
      "choices": ["Flip out"]
    },
    {
      "id": 10006,
      "name": "Dorm Room (flipping out)",
      "available_commands": {
        "calm down": 10007
      },
      "story_text": [
        "You flip out."
      ],
      "choices": ["calm down"]
    },
    {
      "id": 10007,
      "name": "Dorm Room (calming down)",
      "available_commands": {
        "walk out": 10008
      },
      "story_text": [
        "You stand there, staring at the last sticky note in disbelief. Your project is MIA, your laptop is dead, and your lucky mug is gone.",
        "The universe is conspiring against you, and it's working.",
        "",
        "\"Okay... okay. Breathe. Just find your stuff, Farrell. You've got this.\"",
        "",
        "Whoever's putting up all these notes around your room is about to experience a very, very unfortunate accident. But for now, you get ready to find your belongings."
      ],
      "choices": ["Walk out"]
    },
    {
      "id": 10008,
      "name": "Dorm Room (walk out)",
      "available_commands": {
        "wear pants": 10009
      },
      "story_text": [
        "You open the door with a sense of determination - only to be met by a cold draft.",
        "",
        "Another note flutters from the doorframe:",
        "[\"You should probably wear some pants, haha.\"]",
        "",
        "Embarassed, you shuffle back inside and grab a pair of jeans from your cupboard. That was close."
      ],
      "choices": ["Wear pants"]
    },
    {
      "id": 10009,
      "name": "Dorm Room (pants)",
      "available_commands": {
        "prepare to go out": 100
      },
      "story_text": [
        "You feel something in your pants. In your pockets, to be precise. Another yellow note.",
        "", 
        "[\"Now might be a good time to get a quick cup of coffee *wink wink nudge nudge*\"]",
        "",
        "Disregarding the questionable nature of these notes, you decide that it's a good idea. You might find some clues in Cafe Reznikoff."
      ],
      "choices": ["prepare to go out"],
      "new_objective": "Search for clues in Cafe Reznikoff."
    },
    {
      "id": 110001,
      "name": "Cafe Reznikoff (First Visit)",
      "available_commands": {
        "order coffee": 110002
      },
      "story_text": [
        "You follow the cryptic clue from the last yellow note, your mind racing as you weave through the campus streets. The cold air of Toronto's winter nips at your face, but there's no time to slow down. You push open the door to Cafe Reznikoff, the familiar aroma of coffee and baked goods wrapping around you like a warm blanket. For a moment, the panic eases."
      ],
      "choices": ["Order coffee"]
    },
    {
      "id": 110002,
      "name": "Cafe Reznikoff (Coffee Spill)",
      "available_commands": {
        "grab napkin": 110003
      },
      "story_text": [
        "You order your usual; because somehow, even in this chaos, caffeine feels like the only thing holding you together. As the barista hands you the cup, you notice something strange: your name is written perfectly, but underneath it, in smaller letters, there's a faint smudge, like someone started to write something but thought better of it.",
        "You shake it off, finding a corner seat by the window. The first sip of coffee is a small victory, but as you lean back, your elbow knocks the cup. It wobbles, then tips, sending a wave of coffee across the table.", 
        "\"No, no, no!\", you groan."
      ],
      "choices": ["grab napkins"]
    },
    {
      "id": 110003,
      "name": "Cafe Reznikoff (flipping out)",
      "available_commands": {
        "grab napkin": 110004
      },
      "story_text": [
        "You grab a handful of napkins from the dispenser, and proceed to clean up the mess. As you try to wipe the coffee down, something catches your eye.",
        "One of the napkins, it seems, is not like the others. On it, in the same unmistakable handwriting as the yellow notes, are the words:",
        "",
        "[\"Wow. ONE JOB. You had ONE JOB. Good thing you're not an engineering student smh\"]",
        "",
        "You blink. Your coffee-soaked, sleep-deprived brain can barely process the sarcasm. But there seems to be more on the back of the napkin."
      ],
      "choices": ["flip napkin"]
    },
    {
      "id": 110004,
      "name": "Cafe Reznikoff (back of the napkin)",
      "available_commands": {
        "grab napkin": 1100
      },
      "story_text": [
        "[\"Anyway, since you're clearly in need of help, here's something to get you started:",
        "",
        "In halls of code where minds ignite,",
        "A lifeline lost to power your might. ",
        "Where turkeys roost with books in tow,",  
        "Your missing work hides deep below.",  
        "Amidst the trees where monarchs ride",  
        "A lucky charm waits safe inside.",
        "",
        "Good Luck!\"]",
        "",
        "You commit the clue to memory, and it finally dawns on you: Someone, or something, wants him to find these items.",
        "The only question is... why?"
      ],
      "choices": ["get up"]
    },
    {
      "id": 90001,
      "name": "Game Over",
      "available_commands": {},
      "story_text": "You drift back into your slumber... but the deadline doesn't wait.",
      "choices": []
    }
  ],
  "items": [
    {
      "name": "wallet",
      "description": "Contains your TCard.",
      "start_position": 100,
      "current_position": 100
    },
    {
      "name": "bag",
      "description": "Just a bag :D",
      "start_position": 100,
      "current_position": 100
    },
    {
      "name": "first note",
      "description": "A handwritten note, strangely familiar.",
      "start_position": 1
    },
    {
      "name": "laptop charger",
      "description": "Your essential laptop charger.",
      "start_position": 7
    },
    {
      "name": "library note",
      "description": "A note with a cryptic call number.",
      "start_position": 8
    },
    {
      "name": "USB drive",
      "description": "Contains your project.",
      "start_position": 9
    },
    {
      "name": "lucky mug",
      "description": "Your lucky UofT mug.",
      "start_position": 13
    },
    {
      "name": "time-turner",
      "description": "A golden-rimmed pocket watch, its hands moving strangely.",
      "start_position": 13
    }
  ]
}

