{
  "locations": [
    {
      "id": 100,
      "name": "Dorm Room (Knox Residence)",
      "brief_description": "This is your dorm room at Knox Residence. You can go out west to St. George Street or east to Front Campus.",
      "long_description": "The small, dimly-lit room is a chaotic reflection of a student in the middle of midterm season. A single bed sits unmade in the corner, its rumpled sheets tangled like they've been wrestling with your dreams. The faint scent of old coffee and stale instant noodles hangs in the air, blending with the soft hum St. George Street, which lies right outside of your window. You can go out west to St. George Street or east to Front Campus.",
      "extra_description": "A cluttered desk sits against the far wall, buried under stacks of lecture notes, practice exams, empty Red Bull cans, and a sticky note-covered calendar that mocks you with its deadlines. A crooked poster of the CN Tower hangs above it, curling at the edges from humidity. Your trusty backpack lies discarded by the door, half-zipped, as if even it gave up trying to stay organized. You see your wallet, laying flat and open on the table.",
      "available_commands": {
        "go west": 303,
        "go east": 1202
      },
      "items": []
    },
    {
      "id": 200,
      "name": "Robarts Library 1st floor",
      "brief_description": "This is Robarts Library. You can go out east to Saint George and Hoskin Crossroads, west to Robarts Commons, or elevator to the 9th-13th floors",
      "long_description": "You stand before an immense concrete citadel. A towering, brutalist fortress carved from the very essence of stone and geometry. Yes, stone and geometry forming the fearsome silhouette of a... turkey. This is Robarts Library.  You can go out east to Saint George and Hoskin Crossroads or west to Robarts Commons.",
      "extra_description": "You look around the first floor of the library. After some snooping around, you find a pamphlet.",
      "available_commands": {
        "go east": 500,
        "go west": 201,
        "go upstairs": 210,
        "go up to stack": 205
      },
      "items": ["library pamphlet"],
      "first_time_event_id": 20001
    },
    {
      "id": 210,
      "name": "Robarts Library 2nd floor",
      "brief_description": "This is Robarts Library. You can go out east to Saint George and Hoskin Crossroads, west to Robarts Commons, or elevator to the 2nd floor or the stacks",
      "long_description": "You stand before an immense concrete citadel. A towering, brutalist fortress carved from the very essence of stone and geometry. Yes, stone and geometry forming the fearsome silhouette of a... turkey. This is Robarts Library.  You can go out east to Saint George and Hoskin Crossroads or west to Robarts Commons.",
      "extra_description": "You look around the first floor of the library. After some snooping around, you find a pamphlet.",
      "available_commands": {
        "go downstairs": 200,
        "go up to stack": 205
      },
      "items": ["blue pamphlet second page"]
    },
    {
      "id": 201,
      "name": "Robarts Commons 1st floor",
      "brief_description": "You can go east to Robarts Library, or upstairs to the second floor.",
      "long_description": "In contrast to imposing library next door, the Robarts Commons has a vastly different feel. Modern and efficient, minimalist perhaps. The glass covering two sides of the building certainly gives it an open feel. There's a lot of students here. A LOT of students. It's basically full capacity. You can go east to Robarts Library, or upstairs to the second floor.",
      "available_commands": {
        "go east": 200,
        "go upstairs": 202
      },
      "items": []
    },
    {
      "id": 202,
      "name": "Robarts Commons 2nd floor",
      "brief_description": "This is the 2nd floor of Robarts Commons. You can go downstairs to the second floor.",
      "long_description": "This is the 2nd floor of Robarts Commons. You can go downstairs to the second floor.",
      "available_commands": {
        "go upstairs": 203,
        "go downstairs": 201
      },
      "items": []
    },
    {
      "id": 203,
      "name": "Robarts Commons 3rd floor",
      "brief_description": "This is the 3rd floor of Robarts Commons. You can go downstairs to the second floor.",
      "long_description": "This is the 3rd floor of Robarts Commons. You can go downstairs to the second floor.",
      "extra_description": "After looking around for a bit, you find a blue pamphlet lying near the staircase.",
      "available_commands": {
        "go upstairs": 204,
        "go downstairs": 202
      },
      "items": ["blue pamphlet"]
    },
    {
      "id": 204,
      "name": "Robarts Commons 4th floor",
      "brief_description": "Under Construction...",
      "long_description": "Under Construction...",
      "available_commands": {
        "go downstairs": 203
      },
      "items": []
    },
    {
      "id": 500,
      "name": "Saint George and Hoskin Crossroads",
      "brief_description": "This is Saint George and Hoskin Crossroads. You can go out west to Robarts Library, south to St. George Street 1, or east to Hoskin Street 1.",
      "long_description": "You are currently at Saint George and Hoskin Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go west": 200,
        "go south": 301,
        "go east": 401
      },
      "items": []
    },
    {
      "id": 401,
      "name": "Hoskin Street 1",
      "brief_description": "This is Hoskin Street 1. You can go out west to Saint George and Hoskin Crossroads or east to Hoskin Street 2.",
      "long_description": "You are currently at Hoskin Street 1. There's a lot happening around you.",
      "available_commands": {
        "go west": 500,
        "go east": 402
      },
      "items": []
    },
    {
      "id": 402,
      "name": "Hoskin Street 2",
      "brief_description": "This is Hoskin Street 2. You can go out west to Hoskin Street 1, south to Tower Road, or east to Hoskin Street 3.",
      "long_description": "You are currently at Hoskin Street 2. There's a lot happening around you.",
      "available_commands": {
        "go west": 401,
        "go south": 1700,
        "go east": 403
      },
      "items": []
    },
    {
      "id": 403,
      "name": "Hoskin Street 3",
      "brief_description": "This is Hoskin Street 3. You can go out west to Hoskin Street 2 or east to Hoskin and Queen's Crescent Crossroads.",
      "long_description": "You are currently at Hoskin Street 3. There's a lot happening around you.",
      "available_commands": {
        "go west": 402,
        "go east": 800
      },
      "items": []
    },
    {
      "id": 1800,
      "name": "Sir Daniel Wilson Residence Path",
      "brief_description": "This is Sir Daniel Wilson Residence's path. You can go out west to St. George Street 2 or east to Front Campus 1.",
      "long_description": "You are currently at Sir Daniel Wilson Residence Path. There's a lot happening around you.",
      "available_commands": {
        "go west": 302,
        "go east": 1201
      },
      "items": []
    },
    {
      "id": 301,
      "name": "St. George Street 1",
      "brief_description": "This is St. George Street 1. You can go out north to Saint George and Hoskin Crossroads, south to St. George Street 2, or east to Cafe Reznikoff.",
      "long_description": "You are currently at St. George Street 1. There's a lot happening around you.",
      "available_commands": {
        "go north": 500,
        "go south": 302,
        "go east" : 1100
      },
      "items": []
    },
    {
      "id": 302,
      "name": "St. George Street 2",
      "brief_description": "This is St. George Street 2. You can go out north to St. George Street 1, south to St. George Street 3, or east to Sir Daniel Wilson Residence Path.",
      "long_description": "You are currently at St. George Street 2. There's a lot happening around you.",
      "available_commands": {
        "go north": 301,
        "go south": 303,
        "go east": 1800
      },
      "items": []
    },
    {
      "id": 303,
      "name": "St. George Street 3",
      "brief_description": "This is St. George Street 3. You can go out north to St. George Street 2, south to St. George Street 4, or east to Dorm Room (Knox Residence).",
      "long_description": "You are currently at St. George Street 3. There's a lot happening around you.",
      "available_commands": {
        "go north": 302,
        "go south": 304,
        "go east": 100
      },
      "items": []
    },
    {
      "id": 304,
      "name": "St. George Street 4",
      "brief_description": "This is St. George Street 4. You can go out north to St. George Street 3, south to St George and College Crossroads, or west to Bahen.",
      "long_description": "You are currently at St. George Street 4. There's a lot happening around you.",
      "available_commands": {
        "go north": 303,
        "go south":1500,
        "go west": 1600
      },
      "items": []
    },
    {
      "id": 1100,
      "name": "Cafe Reznikoff",
      "brief_description": "This is Cafe Reznikoff. You can go out west to St. George Street 1.",
      "long_description": "You are currently at Cafe Reznikoff. There's a lot happening around you.",
      "available_commands": {
        "go west": 301
      },
      "items": [],
      "first_time_event_id": 110001
    },
    {
      "id": 1201,
      "name": "Front Campus 1",
      "brief_description": "This is Front Campus 1. You can go out north to Hoskin Street 2, south to Front Campus 2, west to Cafe Reznikoff, or east to Hart House Circle.",
      "long_description": "You are currently at Front Campus 1. There's a lot happening around you.",
      "available_commands": {
        "go north": 402,
        "go south": 1202,
        "go west": 1100,
        "go east": 1400
      },
      "items": []
    },
    {
      "id": 1202,
      "name": "Front Campus 2",
      "brief_description": "This is Front Campus 2. You can go out north to Front Campus 1, south to Anatomy Lane, west to Dorm Room (Knox Residence), or east to Hart House Circle.",
      "long_description": "You are currently at Front Campus 2. There's a lot happening around you.",
      "available_commands": {
        "go north": 1201,
        "go south": 1300,
        "go west": 100,
        "go east": 1400
      },
      "items": []
    },
    {
      "id": 1203,
      "name": "King's College Road",
      "brief_description": "This is King's College Road. You can go out north to Front Campus 2 or south to College Street 2.",
      "long_description": "You are currently at King's College Road. There's a lot happening around you.",
      "available_commands": {
        "go north": 1202,
        "go south": 602
      },
      "items": []
    },
    {
      "id": 1300,
      "name": "Anatomy Lane",
      "brief_description": "This is Anatomy Lane. You can go out east to Queen's Park Crescent 3 or west to Front Campus 2.",
      "long_description": "You are currently at Anatomy Lane. There's a lot happening around you.",
      "available_commands": {
        "go east": 903,
        "go west": 1202
      },
      "items": []
    },
    {
      "id": 1400,
      "name": "Hart House Circle",
      "brief_description": "This is Hart House Circle. You can go out west to Front Campus 1 or east to Queen's Park Crescent 2.",
      "long_description": "You are currently at Hart House Circle. There's a lot happening around you.",
      "available_commands": {
        "go west": 1201,
        "go east": 902
      },
      "items": []
    },
    {
      "id": 901,
      "name": "Queen's Park Crescent 1",
      "brief_description": "This is Queen's Park Crescent 1. You can go out north to Hoskin and Queen's Crescent Crossroads, south to Queen's Park Crescent 2, or east to Queen's Park Centre.",
      "long_description": "You are currently at Queen's Park Crescent 1. There's a lot happening around you.",
      "available_commands": {
        "go north": 800,
        "go south": 902,
        "go east": 1002
      },
      "items": []
    },
    {
      "id": 902,
      "name": "Queen's Park Crescent 2",
      "brief_description": "This is Queen's Park Crescent 2. You can go out north to Queen's Park Crescent 1, south to Queen's Park Crescent 3, west to Hart House Circle, or east to Ontario governor'S Office.",
      "long_description": "This is Queen's Park Crescent 2. You can go out north to Queen's Park Crescent 1, south to Queen's Park Crescent 3, west to Hart House Circle, or east to Ontario governor'S Office.",
      "extra_description": "You look around, and you find the man you spoke to earlier. \"Have you seen Winnie?\" You tell him you'll update him when you find a clue.",
      "available_commands": {
        "go north": 901,
        "go south": 903,
        "go west": 1400,
        "go east": 1003
      },
      "items": [],
      "first_time_event_id": 10002
    },
    {
      "id": 903,
      "name": "Queen's Park Crescent 3",
      "brief_description": "This is Queen's Park Crescent 3. You can go out north to Queen's Park Crescent 2, south to Queen's Park Crescent & College Crossroads, west to Anatomy Lane, or east to Queen's Park South.",
      "long_description": "You are currently at Queen's Park Crescent 3. There's a lot happening around you.",
      "available_commands": {
        "go north": 902,
        "go south": 904,
        "go west": 700,
        "go east": 1004
      },
      "items": []
    },
    {
      "id": 1001,
      "name": "Queen's Park North",
      "brief_description": "This is Queen's Park North. You can go out west to Hoskin and Queen's Crescent Crossroads or south to Queen's Park Centre.",
      "long_description": "This is Queen's Park North. You can see the statue of King Edward VII looking over the park. You can go out west to Hoskin and Queen's Crescent Crossroads or south to Queen's Park Centre.",
      "available_commands": {
        "go west": 800,
        "go south": 1002
      },
      "items": [],
      "first_time_event_id": 100001
    },
    {
      "id": 1002,
      "name": "Queen's Park Centre",
      "brief_description": "This is Queen's Park Centre. You can go out north to Queen's Park North, south to Ontario Governor'S Office, or west to Queen's Park Crescent 1.",
      "long_description": "You are currently at Queen's Park Centre. There's a lot happening around you.",
      "available_commands": {
        "go north": 1001,
        "go south": 1003,
        "go west": 901
      },
      "items": []
    },
    {
      "id": 1003,
      "name": "Ontario Governor'S Office",
      "brief_description": "This is Ontario Governor'S Office. You can go out north to Queen's Park Centre, south to Queen's Park South, or west to Queen's Park Crescent 2.",
      "long_description": "You are currently at Ontario governor'S Office. There's a lot happening around you.",
      "available_commands": {
        "go north": 1002,
        "go south": 1004,
        "go west": 902
      },
      "items": []
    },
    {
      "id": 1004,
      "name": "Queen's Park South",
      "brief_description": "This is Queen's Park South. You can go out north to Ontario Governor'S Office or west to Queen's Park Crescent 3.",
      "long_description": "This is Queen's Park South, a scenic park right on the lawn of Ontario's legislative building. You can see the veteran's memorial, a smooth black marble monument, and a dog sleeping on top of the cold stone. You can go out north to Ontario Governor'S Office or west to Queen's Park Crescent 3.",
      "extra_description": "You see a poodle sleeping on the cool black marble of the Veteran's Memorial.",
      "available_commands": {
        "go north": 1003,
        "go west": 903
      },
      "items": []
    },
    {
      "id": 700,
      "name": "College and Queen's Crescent Crossroads",
      "brief_description": "This is College and Queen's Crescent Crossroads. You can go out west to College Street 3.",
      "long_description": "You are currently at College and Queen's Crescent Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go west": 603
      },
      "items": []
    },
    {
      "id": 800,
      "name": "Hoskin and Queen's Crescent Crossroads",
      "brief_description": "This is Hoskin and Queen's Crescent Crossroads. You can go out west to Hoskin Street 3, south to Queen's Park Crescent 1, or east to Queen's Park North.",
      "long_description": "You are currently at Hoskin and Queen's Crescent Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go west": 403,
        "go south": 901,
        "go east": 1001
      },
      "items": []
    },
    {
      "id":1500,
      "name": "St George and College Crossroads",
      "brief_description": "This is St George and College Crossroads. You can go out north to St. George Street 4 or east to College Street 1.",
      "long_description": "You are currently at St George and College Crossroads. There's a lot happening around you.",
      "available_commands": {
        "go north": 304,
        "go east": 601
      },
      "items": []
    },
    {
      "id": 601,
      "name": "College Street 1",
      "brief_description": "This is College Street 1. You can go out west to St George and College Crossroads or east to College Street 2.",
      "long_description": "You are currently at College Street 1. There's a lot happening around you.",
      "available_commands": {
        "go west":1500,
        "go east": 602
      },
      "items": []
    },
    {
      "id": 602,
      "name": "College Street 2",
      "brief_description": "This is College Street 2. You can go out west to College Street 1 or east to College Street 3.",
      "long_description": "You are currently at College Street 2. There's a lot happening around you.",
      "available_commands": {
        "go west": 601,
        "go east": 603
      },
      "items": []
    },
    {
      "id": 603,
      "name": "College Street 3",
      "brief_description": "This is College Street 3. You can go out west to College Street 2 or east to College and Queen's Crescent Crossroads.",
      "long_description": "You are currently at College Street 3. There's a lot happening around you.",
      "available_commands": {
        "go west": 602,
        "go east": 700
      },
      "items": []
    },
    {
      "id": 1700,
      "name": "Tower Road",
      "brief_description": "This is Tower Road. You can go out north to Hoskin Street 2 or south to Front Campus 1.",
      "long_description": "You are currently at Tower Road. There's a lot happening around you.",
      "available_commands": {
        "go north": 402,
        "go south": 1201
      },
      "items": []
    },
    {
      "id": 1600,
      "name": "Bahen Entrance",
      "brief_description": "This is the Bahen Centre for Information Technology. You can go east to St. George Street 4, north to the Auditorium, or go upstairs.",
      "long_description": "This is the Entrance to Bahen. The place is buzzing with activity. You can go east to St. George Street 4, north to the Auditorium, or west to go upstairs.",
      "extra_description": "As you look around, you find a note on the bulletin board, this one not quite in the all-too familiar handwriting of the yellow notes. It says, Lost & Found: Laptop charger. Computer Lab 2294.",
      "available_commands": {
        "go out": 304,
        "go north": 1602,
        "go upstairs": 1601
      },
      "items": [],
      "first_time_event_id": 160001
    },
    {
      "id": 1601,
      "name": "Bahen 2nd Floor Staircase",
      "brief_description": "This is the 2nd floor staircase of Bahen. You can go right to the Engineering section, go upstairs, go downstairs, or left to the CS Section.",
      "long_description": "This is the 2nd floor staircase of Bahen. You can go right to the Engineering section, go upstairs, go downstairs, or left to the CS Section.",
      "available_commands": {
        "go right": 1603,
        "go downstairs": 1600,
        "go left": 1604,
        "go upstairs": 1605
      },
      "items": []
    },
    {
      "id": 1603,
      "name": "Engineering Section",
      "brief_description": "This is the Engineering Section. You can go back to the 2nd floor staircase.",
      "long_description": "This is the Engineering Section. You can go back to the 2nd floor staircase.",
      "available_commands": {
        "go back": 1601
      },
      "items": []
    },
    {
      "id": 1604,
      "name": "2nd Floor CS Wing",
      "brief_description": "This is the CS wing. You can go left to the bathrooms, forward to CSSU, right to Room 2294, or go back to the staircase.",
      "long_description": "This is the CS wing. You can go left to the bathrooms, forward to CSSU, right to Room 2294, or go back to the staircase.",
      "available_commands": {
        "go back": 1601,
        "go right": 1608,
        "go forward":1607,
        "go left": 1606
      },
      "items": []
    },
    {
      "id": 1605,
      "name": "3rd Floor Bahen",
      "brief_description": "This is the third floor of Bahen. Looks kinda desolate ngl...",
      "long_description": "This is the third floor of Bahen. Looks kinda desolate ngl...",
      "available_commands": {
        "go back": 1601
      },
      "items": []
    },
    {
      "id": 1606,
      "name": "Bathroom",
      "brief_description": "This is the bathroom. What are you doing here?",
      "long_description": "This is the bathroom. What are you doing here?",
      "available_commands": {
        "go west": 1604
      },
      "items": []
    },
    {
      "id": 1607,
      "name": "CSSU",
      "brief_description": "This is the CSSU. You can go out to the CS wing.",
      "long_description": "This is the CSSU. It's a relatively small room that feels homely. You see several vending machines and snack drawers near the entrance.",
      "extra_description": "You find nothing of note. Maybe you should use the key ",
      "available_commands": {
        "go out": 1604
      },
      "items": []
    },
    {
      "id": 1602,
      "name": "Adel Sedra Auditorium",
      "locked_description": "This is the Adel Sedra Auditorium. The door is currently locked. You can go out into the main hall.",
      "long_description": "This is the Adel Sedra Auditorium. It's a big, open space, almost like a movie theatre, except that it's lined with tables. You can go out into the main hall.",
      "extra_description": "You try to look around the room for some clues. As you approach the stage, you find a locked box with a keyslot on top of the lectern. Perhaps you should use a key here.",
      "available_commands": {
        "go out":1600
      },
      "items": [],
      "is_locked": true,
      "unlock_condition": "'mysterious-er key' in inventory"
    },
    {
      "id": 1608,
      "name": "Room 2294",
      "locked_description": "Room 2294, the computer lab that *supposedly* contains your missing charger.",
      "unlocked_description": "Room 2294, the promised land. A rather unassuming promised land at that. It's a lab filled with lines of tables and computers. You see the lost-and-found box in the corner.",
      "extra_description": "Room 2294, the promised land. A rather unassuming promised land at that. It's a lab filled with lines of tables and computers. You see the lost-and-found box in the corner, and you find your charger in it.",
      "available_commands": {
        "go east": 1604
      },
      "items": ["laptop charger"],
      "is_locked": true,
      "unlock_condition": "'tcard' in inventory",
      "first_time_event_id": 160002
    }
  ],
  "story_events": [
    {
      "id": 1,
      "name": "Dorm Room (Wake Up)",
      "available_commands": {
        "turn off alarm": 10001
      },
      "story_text": "You jolt awake to the sound of Reveille, your alarm blasting the sound of trumpets into your ears.",
      "choices": ["Turn off alarm"]
    },
    {
      "id": 10001,
      "name": "Dorm Room (Alarm)",
      "available_commands": {
        "wake up": 10002,
        "go back to sleep": 90001
      },
      "story_text": "The room is eerily quite now. The alarm is off, but your heart is still racing. What will you do?",
      "choices": ["Wake up", "Go back to sleep"]
    },
    {
      "id": 10002,
      "name": "Dorm Room (Waking up)",
      "available_commands": {
        "check alarm label": 10003
      },
      "story_text": "You are groggy and disoriented, but you force yourself up. You mind is fuzzy, and you can't recall anything. You look around to see if anything will clue you in.",
      "choices": ["Check alarm label"]
    },
    {
      "id": 10003,
      "name": "Dorm Room (Alarm Label)",
      "available_commands": {
        "next": 10004
      },
      "story_text": "You check your alarm label. Oh. Oh no. The Project!",
      "choices": ["Next"]
    },
    {
      "id": 10004,
      "name": "Dorm Room (Uh oh)",
      "available_commands": {
        "read note": 10005
      },
      "story_text": [
        "The realization hits you like a sledgehammer to the brain.",
        "Your eyes dart to the clock. The deadline is at 4 PM. Panic wells up inside you, but something else catches your eye: a crumpled note on your desk.",
        "You rub the sleep from your eyes, heart pounding like it's running a marathon. You snatch the note with trembling fingers."
      ],
      "choices": ["Read note"]
    },
    {
      "id": 10005,
      "name": "Dorm Room (First Mysterious Note)",
      "available_commands": {
        "flip out": 10006
      },
      "story_text": [
        "[\"Calm down, sleepyhead! You're gonna need your wits today.\"]",
        "The handwriting looks... familiar. But there's no time to dwell on that. You need to submit your project. You open your laptop. It's out cold.",
        "You find another yellow sticky note on your laptop screen:",
        "",
        "[\"My condolences :D\"]",
        "",
        "\"You've got to be kidding me!\", you scream internally.",
        "",
        "\"Well, at least I've still got my trusty ol' mug!\" You open your drawer, to where your lucky mug was, is, and always will be.",
        "Instead of a mug, you find yet another yellow note.",
        "[\"Shouldn't have said that ;D\"]"
      ],
      "choices": ["Flip out"]
    },
    {
      "id": 10006,
      "name": "Dorm Room (flipping out)",
      "available_commands": {
        "calm down": 10007
      },
      "story_text": [
        "You flip out."
      ],
      "choices": ["calm down"]
    },
    {
      "id": 10007,
      "name": "Dorm Room (calming down)",
      "available_commands": {
        "walk out": 10008
      },
      "story_text": [
        "You stand there, staring at the last sticky note in disbelief. Your project is MIA, your laptop is dead, and your lucky mug is gone.",
        "The universe is conspiring against you, and it's working.",
        "",
        "\"Okay... okay. Breathe. Just find your stuff, Farrell. You've got this.\"",
        "",
        "Whoever's putting up all these notes around your room is about to experience a very, very unfortunate accident. But for now, you get ready to find your belongings."
      ],
      "choices": ["Walk out"]
    },
    {
      "id": 10008,
      "name": "Dorm Room (walk out)",
      "available_commands": {
        "wear pants": 10009
      },
      "story_text": [
        "You open the door with a sense of determination - only to be met by a cold draft.",
        "",
        "Another note flutters from the doorframe:",
        "[\"You should probably wear some pants, haha.\"]",
        "",
        "Embarassed, you shuffle back inside and grab a pair of jeans from your cupboard. That was close."
      ],
      "choices": ["Wear pants"]
    },
    {
      "id": 10009,
      "name": "Dorm Room (pants)",
      "available_commands": {
        "prepare to go out": 100
      },
      "story_text": [
        "You feel something in your pants. In your pockets, to be precise. Another yellow note.",
        "",
        "[\"Now might be a good time to get a quick cup of coffee *wink*\"]",
        "",
        "Disregarding the questionable nature of these notes, you decide that it's a good idea. You might find some clues in Cafe Reznikoff."
      ],
      "choices": ["prepare to go out"],
      "new_objective": "Search for clues in Cafe Reznikoff."
    },
    {
      "id": 110001,
      "name": "Cafe Reznikoff (First Visit)",
      "available_commands": {
        "order coffee": 110002
      },
      "story_text": [
        "You follow the cryptic clue from the last yellow note, your mind racing as you weave through the campus streets.",
        "The cold air of Toronto's winter nips at your face, but there's no time to slow down.",
        "You push open the door to Cafe Reznikoff, the familiar aroma of coffee and baked goods wrapping around you like a warm blanket. For a moment, the panic eases."
      ],
      "choices": ["Order coffee"]
    },
    {
      "id": 110002,
      "name": "Cafe Reznikoff (Coffee Spill)",
      "available_commands": {
        "grab napkin": 110003
      },
      "story_text": [
        "You order your usual; because somehow, even in this chaos, caffeine feels like the only thing holding you together. As the barista hands you the cup, you notice something strange: your name is written perfectly, but underneath it, in smaller letters, there's a faint smudge, like someone started to write something but thought better of it.",
        "You shake it off, finding a corner seat by the window. The first sip of coffee is a small victory, but as you lean back, your elbow knocks the cup. It wobbles, then tips, sending a wave of coffee across the table.",
        "\"No, no, no!\", you groan."
      ],
      "choices": ["grab napkins"]
    },
    {
      "id": 110003,
      "name": "Cafe Reznikoff (flipping out)",
      "available_commands": {
        "flip napkin": 110004
      },
      "story_text": [
        "You grab a handful of napkins from the dispenser, and proceed to clean up the mess. As you try to wipe the coffee down, something catches your eye.",
        "One of the napkins, it seems, is not like the others. On it, in the same unmistakable handwriting as the yellow notes, are the words:",
        "",
        "[\"Wow. ONE JOB. You had ONE JOB. Good thing you're not an engineering student smh\"]",
        "",
        "You blink. Your coffee-soaked, sleep-deprived brain can barely process the sarcasm. But there seems to be more on the back of the napkin."
      ],
      "choices": ["flip napkin"]
    },
    {
      "id": 110004,
      "name": "Cafe Reznikoff (back of the napkin)",
      "available_commands": {
        "prepare to go out": 1100
      },
      "story_text": [
        "[\"Anyway, since you're clearly in need of help, here's something to get you started:",
        "",
        "In halls of code where minds ignite,",
        "A lifeline lost to power your might. ",
        "Where turkeys roost with books in tow,",
        "Your missing work hides deep below.",
        "Amidst the trees where monarchs ride",
        "A lucky charm waits safe inside.",
        "",
        "Good Luck!\"]",
        "",
        "You commit the clue to memory, and it finally dawns on you: Someone, or something, wants him to find these items.",
        "The only question is... why?"
      ],
      "choices": ["prepare to go out"],
      "items": ["Mysterious Note"],
      "new_objective": "Find your missing items before 4 PM."
    },
    {
      "id": 160001,
      "name": "Bahen (Arrival)",
      "available_commands": {
        "next": 1600
      },
      "story_text": [
        "As you step into the Bahen Centre for Information Technology, you can immediately feel the change in atmosphere.",
        "The air is filled with the muffled hum of conversations and the clack of keyboards from nearby study rooms.",
        "The hallway is lined with bulletin boards, some filled with CS job postings, event flyers, and cryptic memes.",
        "You have a sneaky suspicion you left your charger here on a coding sessions you did."
      ],
      "choices": ["next"]
    },
    {
      "id": 160002,
      "name": "ROOM 2294 (First Time, no Tcard)",
      "available_commands": {
        "ok": 1608
      },
      "story_text": [
        "You arrive at Room 2294 in the Bahen Centre, where your laptop charger is supposedly waiting in the lost-and-found box.",
        "The door stands before you, ominously locked with a TCard scanner blinking expectantly.",
        "\"Oops, need a TCard for that.\"",
        "You reach for your wallet. (did you grab it in your room earlier? If so, you can \"use wallet\")"
      ],
      "choices": ["next"]
    },
    {
      "id": 160003,
      "name": "ROOM 2294 (Wallet Use)",
      "available_commands": {
        "turn back": 1608
      },
      "story_text": [
        "You reach into your pocket for your wallet, confident you'll swipe your TCard and breeze right in. But instead of the familiar plastic card, your fingers brush against something else.",
        "You pull out a small, crumpled note and a key. Your heart sinks as you unfold the paper.",
        "",
        "[\"You really thought it was gonna be that easy?",
        "Yar har har! The key opens more than just doors... but not this one! Good luck, genius.",
        "Hint: Head to the CSSU.\"]",
        "",
        "Your stomach drops. Whoever's leaving these notes is clearly messing with you, and they're enjoying it.",
        "The key doesn't fit the door to Room 2294, and now you're left wondering where your TCard is.",
        "You stuff the note back in your pocket, grip the mysterious key, and get ready to follow the next clue - because this is turning into more than just a simple fetch quest."
      ],
      "choices": ["turn back"],
      "new_objective": "Search for clues at the CSSU.",
      "items": ["mysterious key"]
    },
    {
      "id": 160005,
      "name": "CSSU Vault open",
      "available_commands": {
        "leave": 1604
      },
      "story_text": [
        "You enter password, shifted by three, [sdvvzrug] into the alphabetical lock.",
        "",
        "*click*",
        "",
        "The safe swings open, revealing another key inside, and, you guessed it, yet another note.",
        "[\"Not bad, now head to the auditorium\"]"
      ],
      "choices": ["leave"],
      "new_objective": "Search for clues at the auditorium.",
      "items": ["mysterious-er key"]
    },
    {
      "id": 160006,
      "name": "Auditorium Puzzle Intro",
      "available_commands": {
        "investigate": 160007
      },
      "story_text": [
        "You open the carved wooden box you found at the lectern. You hold your breath in anticipation, as you find...",
        "\"Another box?\" you ask. The box is small, but fancy, featuring intricate ornaments carved on the oak wood. It is locked by another padlock, this time featuring a 5-digit combination.",
        "You also find what seems to be a fragment of a playbill, the kind you find in theaters. It says:",
        "[\"You ever hear the tragedy of Bubbly the Wise?",
        "The Silent Sonata – A masterpiece performed in the order of elements: Earth, Wind, Fire, Water, Heart. Let their voices guide you.\"]",
        "",
        "\"Rather edgy, innit?\" you say out loud. You pick up the small box and find another note underneath it.",
        "[\"Not as edgy as you lol. Check the seats.\"]",
        "",
        "\"Oh shut up!\" Your irritation aside, you move to investigate the rows of chairs."
      ],
      "choices": ["investigate"],
      "items": []
    },
    {
      "id": 160007,
      "name": "Auditorium Puzzle main loc",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "The Auditorium has nine rows. Which one will you investigate?"
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160008,
      "name": "Auditorium Puzzle 1st row",
      "available_commands": {
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "You find an drawing of a heart on the table."
      ],
      "choices": [
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160009,
      "name": "Auditorium Puzzle 2nd row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "You find nothing on this row."
      ],
      "choices": [
        "investigate 1st row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160010,
      "name": "Auditorium Puzzle 3rd row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "You find a faded drawing of a feather"
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160011,
      "name": "Auditorium Puzzle 4th row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter passkey": 160017
      },
      "story_text": [
        "You find nothing on this row."
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160012,
      "name": "Auditorium Puzzle 5th row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "You find nothing on this row."
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160013,
      "name": "Auditorium Puzzle 6th row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "You find a drawing of a fiery furnace carved on the table."
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 7th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160014,
      "name": "Auditorium Puzzle 7th row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 8th row": 160015,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "You find a drawing of a mountain, cracked in the middle on the table."
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 8th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160015,
      "name": "Auditorium Puzzle 8th row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 9th row": 160016,
        "enter password": 160017
      },
      "story_text": [
        "You find nothing on this row."
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 9th row",
        "enter password"],
      "items": []
    },
    {
      "id": 160016,
      "name": "Auditorium Puzzle 9th row",
      "available_commands": {
        "investigate 1st row": 160008,
        "investigate 2nd row": 160009,
        "investigate 3rd row": 1600010,
        "investigate 4th row": 160011,
        "investigate 5th row": 160012,
        "investigate 6th row": 160013,
        "investigate 7th row": 160014,
        "investigate 8th row": 160015,
        "password": 160017
      },
      "story_text": [
        "You find a spilled water bottle on one of the chairs."
      ],
      "choices": [
        "investigate 1st row",
        "investigate 2nd row",
        "investigate 3rd row",
        "investigate 4th row",
        "investigate 5th row",
        "investigate 6th row",
        "investigate 7th row",
        "investigate 8th row",
        "password"],
      "items": []
    },
    {
      "id": 160018,
      "name": "Lectern Box",
      "available_commands": {
        "next": 1602
      },
      "story_text": [
        "You enter the passkey, and the padlock clicks open! You promptly open the box. You find...",
        "[\"Yar yar yar. Thou hast passed all my trials! Check your bag :D\"]",
        "",
        "\"Check my bag?\", you think to your self. Realization dawns upon you.",
        "",
        "\"No way!\" You are in disbelief. You proceed to check your bag. (Use bag, if you have it. If not, check your dorm room, though you gotta open it here :D)."
      ],
      "choices": ["next"],
      "items": []
    },
    {
      "id": 160019,
      "name": "Bag Check!",
      "available_commands": {
        "next": 1602
      },
      "story_text": [
        "You quickly open your bag, heart racing. \"You've got to be kidding me!\"",
        "Right there, in the front compartment of your bag, lies your TCard."
      ],
      "choices": ["next"],
      "items": ["tcard"],
      "new_objective": "Find your missing items before 4 PM. Tip: You can use \"examine mysterious note to view the clue\""
    },
    {
      "id": 20001,
      "name": "Robarts Library (First Visit)",
      "available_commands": {
        "look around": 200
      },
      "story_text": [
        "You approach Robarts Library, a towering brutalist monolith that looms over the campus like a concrete deity. A turkey-shaped deity, that is.",
        "Its jagged edges and hulking form seem less like a place of learning and more like the final boss in an architecture student's fever dream",
        "Inside, the air hums with the low, collective anxiety of a thousand students wrestling with existential dread and midterms.",
        "You wander into the main study area, and pick a random table to sit on. Surprisingly enough (I'm surprised you're still surprised at this point), you spot a note fluttering under the table.",
        "The note reads:",
        "",
        "[\"Call Number: QA 76.9 R35 2010\"]",
        "",
        "You're puzzled at this indecipherable code. Perhaps you can look around for more clues."
      ],
      "choices": ["look around"],
      "items": ["call number note"],
      "new_objective": "Find clues in Robarts Library."
    },
    {
      "id": 20002,
      "name": "Robarts Library (Library Pamphlet)",
      "available_commands": {
        "next": 20003
      },
      "story_text": [
        "Navigating Robarts Library",
        "Robarts Library contains the largest number of printed materials on campus,",
        "as well as other useful library services that you may find helpful when writing your essay.",
        "The 3rd floor of the library of Robarts is dedicated to different reference materials and helpful staff.",
        "",
        "The Stacks",
        "This area of the library is likely to contain many books that you will find useful in this course and in others.",
        "Thousands of books are found from floor 9 to 13 and are arranged by call numbers.",
        "It may feel overwhelming when you first search for a book here, but following these steps can help make you an expert in no time!",
        "",
        "1. First find out where your book is located and the call number using the U of T Libraries website. ",
        "The call number will be one or two letters followed by some numbers. For example: HQ759 .R48",
        "",
        "2. Next, find out what floor the call number corresponds to.",
        "This can be found at Robarts Library stack guide, by using one of the blue pamphlets entitled “Robarts Library Stack Guide” that can be found around the library.",
        "",
        "Good luck!",
        "Source: https://resourceguideraceclassgender.wordpress.com/navigating-u-of-t-libraries-in-person-and-online/navigating-robarts-library/"
      ],
      "choices": ["next"],
      "items": []
    },
    {
      "id": 20003,
      "name": "Robarts Library (Library Pamphlet next)",
      "available_commands": {
        "look around": 201
      },
      "story_text": [
        "\"Wait, so this pamphlet is telling me to go find another pamphlet?\"",
        "You snarl at this waste of paper. Maybe you'll find better clues at the Commons?"
      ],
      "choices": ["look around"],
      "items": []
    },
    {
      "id": 20004,
      "name": "Robarts Library (USB)",
      "available_commands": {
        "exit": 200
      },
      "story_text": [
        "You sift through the endless rows of dusty tomes until you narrow down your search enough for something to catch your eye.",
        "And catch your eye it does.",
        "Nestled between \"Basic Beginner Python\" and \"Python Distilled\" is a bright, neon colored book titled \"How to Charm a Snake: Python Programming for Aspiring Wizards\".",
        "You roll your eyes; the hardest roll you've possibly ever done. But now's not the time for that.",
        "You grab it out of its shelf and open it.",
        "",
        "*clack*",
        "",
        "A familiar-looking blue-rimmed metal USB falls out of the book. You sigh in relief. That's one more step towards submission."
      ],
      "choices": ["exit"],
      "items": ["usb drive"],
      "new_objective": "Find your missing items before 4 PM. Tip: You can use \"examine mysterious note to view the clue\""
    },
    {
      "id": 100001,
      "name": "Queen's Park North (First Arrival)",
      "available_commands": {
        "exit": 200
      },
      "story_text": [
        "You steps into Queen's Park, the winter wind biting at your ears.",
        "The stoic King Edward VIII equestrian statue stands in the centre, its cold gaze looking over the park.",
        "As you approach, you spot a yellow note fluttering against the statue's base.",
        "",
        "Beneath the monarch's watchful gaze",
        "Your luck awaits through earth's embrace.",
        "But hands alone won't break this ground",
        "Seek three to make the shovel sound."
      ],
      "choices": ["exit"],
      "items": ["park note"],
      "new_objective": "Search Queen's Park and Queen's Park Crescent for clues."
    },
    {
      "id": 100002,
      "name": "Queen's Park Crescent 2 (Dog Event)",
      "available_commands": {
        "continue walking": 902
      },
      "story_text": [
        "Your search brings you to Queen's Park Crescent 2, right next to the scenic Hart House Circle",
        "You see a man, walking towards you looking distraught.",
        "",
        "\"Hey there! Have you seen a poodle running around somewhere around here?\", he asks. You say that you don't quite recall.",
        "",
        "\"Alright, can I ask you a favor? Here's Winnie's dog whistle. If you blow it, he'll know that you're my friend. Please come find me if you see him.\""
      ],
      "choices": ["continue walking"],
      "items": ["dog whistle"]
    },
    {
      "id": 100003,
      "name": "Queen's Park South (Found Winnie!)",
      "available_commands": {
        "continue walking": 1004
      },
      "story_text": [
        "You spot Winnie and you blow the whistle. The dog comes running towards you, tail wagging in excitement."
      ],
      "choices": ["continue walking"],
      "items": ["winnie the poodle"]
    },
    {
      "id": 100004,
      "name": "Queen's Park Crescent 2 (Dog Owner)",
      "available_commands": {
        "continue walking": 902
      },
      "story_text": [
        "\"Winnie! Thank goodness you're alright!\"",
        "",
        "You hand over the dog to its owner.",
        "",
        "\"Thanks a ton! I found this old handle while walking Max this morning. Figured it might be useful for something, but I think you’ll make better use of it. Good luck!\"",
        "\"Uhhh thanks?\", you reply."
      ],
      "choices": ["continue walking"],
      "items": ["wooden handle"]
    },
    {
      "id": 90001,
      "name": "Game Over",
      "available_commands": {},
      "story_text": "You drift back into your slumber... but the deadline doesn't wait.",
      "choices": []
    }
  ],
  "puzzle": [
    {
      "id": 160004,
      "name": "CSSU Puzzle",
      "available_commands":{
        "password": 160005
      },
      "puzzle_text": [
        "You look for places you can use the key, and you see a cupboard below the kitchennette.",
        "You give the key a try, and to your surprise, it fits.",
        "The cupboard opens up, and inside lies a safe, with a yellow note sticking off the side.",
        "",
        "[\"A ruler once, a salad now,",
        "Shifted words unlock the vow.",
        "I came, I saw, I conquered: three,",
        "Is the key to set you free.",
        "Enter password to open.\"]"
      ],
      "answers": ["sdvvzrug"]
    },
    {
      "id": 160017,
      "name": "Auditorium Puzzle",
      "available_commands":{
        "password": 160018,
        "investigate": 160007
      },
      "puzzle_text": [
        "You can try entering the 5 digit passkey, or type investigate to continue investigating."
      ],
      "answers": ["73691"]
    },
    {
      "id": 205,
      "name": "Robarts Library Stack",
      "available_commands": {
        "book search": 206,
        "go floor 1": 200
      },
      "puzzle_text": [
        "This is the 9th-13th floor of Robarts Library. You see a LOT of books on the shelves. Which floor would you like to search?"
      ],
      "answers":["13"]
    },
    {
      "id": 206,
      "name": "Robarts Library 13th floor",
      "available_commands": {
        "book search": 207,
        "go floor 1": 200
      },
      "puzzle_text": [
        "This is the 13th floor of Robarts Library. You see a LOT of books on the shelves. Which category would you like to search?"
      ],
      "answers":["mathematics"]
    },
    {
      "id": 207,
      "name": "Robarts Library Mathematics (Q Section)",
      "available_commands": {
        "book search": 208,
        "go floor 1": 200
      },
      "puzzle_text": ["This is the Mathematics section. Which subcategory would you like to visit?"],
      "answers":["computer science"]
    },
    {
      "id": 208,
      "name": "Robarts Library Computer Science Shelf",
      "available_commands": {
        "book search": 20004,
        "go floor 1": 200
      },
      "puzzle_text": ["This is the Computer Science Shelf. What topic are you looking for?"],
      "answers":["python"]
    },
    {
      "id": 21001,
      "name": "The Second Blue Pamphlet",
      "available_commands": {
        "inquire": 21001,
        "password": 210
      },
      "puzzle_text": [
        "You find a blue pamphlet that contains an enormous amount of information.",
        "If you wish to return, type password and then enter: return to the realm of the living."
      ],
      "answers": ["return to the realm of the living"]
    }
  ],
  "items": [
    {
      "name": "wallet",
      "description": "Just an inconspicuous wallet...",
      "start_position": 100,
      "current_position": 100,
      "use_location": 1608,
      "triggers_event_id": 160003
    },
    {
      "name": "bag",
      "description": "Just a bag :D",
      "start_position": 100,
      "current_position": 100,
      "use_location": 1602,
      "triggers_event_id": 160019
    },
    {
      "name": "mysterious note",
      "description": "\"In halls of code where minds ignite,\",\n        \"A lifeline lost to power your might. \",\n        \"Where turkeys roost with books in tow,\",\n        \"Your missing work hides deep below.\",\n        \"Amidst the trees where monarchs ride\",\n        \"A lucky charm waits safe inside.\"",
      "start_position": 110004,
      "current_position": 110004
    },
    {
      "name": "mysterious key",
      "description": "A key that opens something at CSSU...",
      "start_position": 160003,
      "current_position": 160003,
      "use_location": 1607,
      "triggers_event_id": 160004
    },
    {
      "name": "mysterious-er key",
      "description": "A key that opens the door to the Auditorium.",
      "start_position": 160004,
      "current_position": 160004,
      "use_location": 1602,
      "triggers_event_id": 160006
    },
    {
      "name": "library pamphlet",
      "description": "A figurative key to the library. type \"use library pamphlet\" to use.",
      "start_position": 200,
      "current_position": 200,
      "use_location": 200,
      "triggers_event_id": 20002
    },
    {
      "name": "blue pamphlet first page",
      "description": "9th Floor AC-AZ, B-BX, C-CT, D \n 10th Floor DA-DX, E. F-FC \n 11th Floor G-GV, H-HX, J-JZ, K-KZD  \n 12th Floor L-LT, M-MT, N-NX, P-PM  \n 13th Floor PN-PT, TR, TT, U-UH, V-VM, Z \n What do these codes mean? Consult the second page of our pamphlet :D",
      "start_position": 203,
      "current_position": 203
    },
    {
      "name": "blue pamphlet second page",
      "description": "This second \"page\" is uhhh rather long. Try using it.",
      "start_position": 210,
      "current_position": 210,
      "use_location": 210,
      "triggers_event_id": 21001
    },
    {
      "name": "laptop charger",
      "description": "Your essential laptop charger.",
      "start_position": 1608
    },
    {
      "name": "call number note",
      "description": "[Call Number: QA 76.73.P98] hint: it's a snake!",
      "start_position": 20001
    },
    {
      "name": "tcard",
      "description": "Your lovely TCard.",
      "start_position": 160018
    },
    {
      "name": "usb drive",
      "description": "Contains your project.",
      "start_position": 20004
    },
    {
      "name": "dog whistle",
      "description": "Winnie the Poodle's favourite whistle. If you see him, use it!",
      "start_position": 10002,
      "current_position": 10002,
      "use_location": 1004,
      "triggers_event_id": 100003
    },
    {
      "name": "winnie the poodle",
      "description": "Who's a gooooood boooooooy!!!",
      "start_position": 1004,
      "current_position": 1004,
      "use_location": 902,
      "triggers_event_id": 100004
    },
    {
      "name": "wooden handle",
      "description": "Looks like the shaft of some digging tool?",
      "start_position": 100004,
      "current_position": 100004,
      "use_location": 1001,
      "triggers_event_id": 100004
    },
    {
      "name": "lucky mug",
      "description": "Your lucky UofT mug.",
      "start_position": 13
    },
    {
      "name": "time-turner",
      "description": "A golden-rimmed pocket watch, its hands moving strangely.",
      "start_position": 13
    }
  ]
}

